
PS C:\Users\athul> cd D:\temporary_datasets\VScode\SQL\SQL_Basics
PS D:\temporary_datasets\VScode\SQL\SQL_Basics> duckdb pyaihub_analytics.db
DuckDB v1.4.4 (Andium) 6ddac802ff
Enter ".help" for usage hints.
D SELECT * FROM students;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│          1 │ Arun    │    21 │ Chennai   │
│          2 │ Meera   │    22 │ Mumbai    │
│          3 │ Rahul   │    23 │ Delhi     │
│          4 │ Ananya  │    20 │ Bangalore │
└────────────┴─────────┴───────┴───────────┘
D SELECT * FROM students ORDER BY age;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│          4 │ Ananya  │    20 │ Bangalore │
│          1 │ Arun    │    21 │ Chennai   │
│          2 │ Meera   │    22 │ Mumbai    │
│          3 │ Rahul   │    23 │ Delhi     │
└────────────┴─────────┴───────┴───────────┘
D SELECT * FROM students ORDER BY age DESC;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│          3 │ Rahul   │    23 │ Delhi     │
│          2 │ Meera   │    22 │ Mumbai    │
│          1 │ Arun    │    21 │ Chennai   │
│          4 │ Ananya  │    20 │ Bangalore │
└────────────┴─────────┴───────┴───────────┘
D SELECT * FROM students ORDER BY age ASC;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│          4 │ Ananya  │    20 │ Bangalore │
│          1 │ Arun    │    21 │ Chennai   │
│          2 │ Meera   │    22 │ Mumbai    │
│          3 │ Rahul   │    23 │ Delhi     │
└────────────┴─────────┴───────┴───────────┘
D SELECT * FROM students ORDER BY name;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│          4 │ Ananya  │    20 │ Bangalore │
│          1 │ Arun    │    21 │ Chennai   │
│          2 │ Meera   │    22 │ Mumbai    │
│          3 │ Rahul   │    23 │ Delhi     │
└────────────┴─────────┴───────┴───────────┘
D SELECT * FROM students ORDER BY name DESC;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│          3 │ Rahul   │    23 │ Delhi     │
│          2 │ Meera   │    22 │ Mumbai    │
│          1 │ Arun    │    21 │ Chennai   │
│          4 │ Ananya  │    20 │ Bangalore │
└────────────┴─────────┴───────┴───────────┘
D SELECT * FROM students LIMIT 2;
┌────────────┬─────────┬───────┬─────────┐
│ student_id │  name   │  age  │  city   │
│   int32    │ varchar │ int32 │ varchar │
├────────────┼─────────┼───────┼─────────┤
│          1 │ Arun    │    21 │ Chennai │
│          2 │ Meera   │    22 │ Mumbai  │
└────────────┴─────────┴───────┴─────────┘
D SELECT * FROM students ORDER BY age DESC LIMIT 2;
┌────────────┬─────────┬───────┬─────────┐
│ student_id │  name   │  age  │  city   │
│   int32    │ varchar │ int32 │ varchar │
├────────────┼─────────┼───────┼─────────┤
│          3 │ Rahul   │    23 │ Delhi   │
│          2 │ Meera   │    22 │ Mumbai  │
└────────────┴─────────┴───────┴─────────┘
D SELECT * FROM students ORDER BY age DESC LIMIT 3;
┌────────────┬─────────┬───────┬─────────┐
│ student_id │  name   │  age  │  city   │
│   int32    │ varchar │ int32 │ varchar │
├────────────┼─────────┼───────┼─────────┤
│          3 │ Rahul   │    23 │ Delhi   │
│          2 │ Meera   │    22 │ Mumbai  │
│          1 │ Arun    │    21 │ Chennai │
└────────────┴─────────┴───────┴─────────┘
D SELECT * FROM students ORDER BY age ASC LIMIT 1;
┌────────────┬─────────┬───────┬───────────┐
│ student_id │  name   │  age  │   city    │
│   int32    │ varchar │ int32 │  varchar  │
├────────────┼─────────┼───────┼───────────┤
│     4      │ Ananya  │  20   │ Bangalore │
└────────────┴─────────┴───────┴───────────┘
D
